[
  {
      "id": 6,
      "employer": "LaunchCode (Part-Time WebDev Program)",
      "period": "April 2022 - present",
      "title": "Lead Instructor",
      "type": "Freelance",
      "location": "St. Louis, MO",
      "desc": "Currently teaching Part-Time WebDev which includes JavaScript, HTML, CSS, TypeScript, Angular, Java, Spring Boot with Gradle, Thymeleaf, Hibernate & SQL. Students learn about consuming APIs, the DOM, unit testing with TDD, Git workflow, object-oriented programming, CRUD operations, object relational mapping, and more. Previously also taught the Liftoff course with capstone projects and career prep topics such as SLDC, Agile, project ideation & planning, user story mapping, data schemas, wireframing, résumés, online profiles & portfolios, behavioral interviews, technical interviews, and live coding. Lecture prep has included creating dozens of new REPLs, Angular projects, and Spring Boot projects for live coding during lecture (in addition to the student practice content I created in previous years as a TA).",
      "image": "lc-logo.png",
      "website": "https://www.launchcode.org"
  },
  {
      "id": 5,
      "employer": "Array US",
      "period": "March 2022 - September 2022",
      "title": "Software Engineer II",
      "type": "Full-time",
      "location": "Remote",
      "desc": "Created engaging, cutting-edge fintech products so that companies can empower their customers to take charge of their financial future with personalized credit information, financial data, and planning tools. Built easy-to-implement, embeddable components with Svelte and TypeScript for seamless integration into clients' apps and websites. Kept an open dialogue with design team to collaborate on UX considerations. Provided code coverage with Playwright testing to improve CI pipeline. Contributed to company documentation for engineer onboarding and best practices. Leveraged agile methodologies to reliably deliver updates and new products regularly. Helped manage Shortcut board and backlog to organize priorities and facilitate efficient team workflow.",
      "image": "array-logo.png",
      "website": "https://array.com/"
  }, 
  {
      "id": 4,
      "employer": "Apex Systems (at Lumen Technologies)",
      "period": "April 2021 - Present",
      "title": "Full Stack Engineer",
      "type": "Full-time",
      "location": "St. Louis, MO",
      "desc": "Re-engineering key platforms and applications for cloud application management and microservices with Morpheus integration at Lumen Technologies. Currently building a custom UI from the ground up with React and Redux, using Jest with Enzyme for unit testing and Cucumber/Puppeteer for end-to-end testing, improving UX. Contributing to development of APIs based in Ruby with Grape and ActiveRecord, utilizing RSpec for test-driven development. Improving CI/CD for multiple environments with automated Jenkins pipelines.",
      "image": "apex-logo.jpg",
      "website": "https://www.lumen.com"
  },
  {
      "id": 0,
      "employer": "LaunchCode (Women+ Program)",
      "period": "August 2020 - January 2022",
      "title": "Tech Leadership Fellow",
      "type": "Freelance",
      "location": "St. Louis, MO",
      "desc": "Mentored students in the Women+ program (WebDev/FrontEnd track). Unit 1 covered JavaScript, HTML, CSS, consuming APIs, the DOM, TypeScript, and Angular, including skills in unit testing, git workflow, and more. Unit 2 took students on a deep dive into React (Angular a in previous cohort). In Liftoff, the course focused on career prep with resume-building, behavioral and technical interview skills, and a capstone project using Agile methodology.</p> <p>Designed <a href='https://tinyurl.com/y3bn6st4' target='_blank'>60+ practice problems/projects for students</a> to complement the Unit 1 LaunchCode curriculum and help students prepare for more difficult graded assignments. These exercises are also now in use by students in LaunchCode's WebDev programs in multiple cities nationally.</p>",
      "image": "lc-logo.png",
      "website": "https://www.launchcode.org"
  },
  {
      "id": 1,
      "employer": "LaunchCode (at Cognizant)",
      "period": "July 2020 - March 2021",
      "title": "MuleSoft Developer",
      "type": "Contract",
      "location": "St. Louis, MO",
      "desc": "Participated in an apprenticeship through LaunchCode to build middleware solutions for businesses at Cognizant Technology Solutions. Earned the Level 1 Developer certification from MuleSoft after intensive training in Mule 4 ESB. Gained knowledge in writing detailed RAML specifications; built Mule applications with API interfacing, DataWeave transformations, data validation, encapsulation of global elements, property placeholders, logging, and error handling. Utilized a wide range of Core, Database, File, HTTP, JMS, Salesforce, and VM connectors to develop flows and subflows, consuming multiple types of web services. Became familiar with AnyPoint Platform, publishing APIs, creating API proxies, implementing SLA policies and client ID enforcement, and deploying applications to CloudHub.",
      "image": "lc-logo.png",
      "website": "https://www.cognizant.com"
  },
  {
      "id": 2,
      "employer": "St. Louis Learning Disabilities Association",
      "period": "March 2015 - April 2020",
      "title": "Grant Writer &#124; Database Manager &#124; Graphic Designer",
      "type": "Full-time",
      "location": "St. Louis, MO",
      "desc": "Authored grant proposals and impact reports for both private and corporate foundations. Streamlined the tracking process, designing an improved file system & master spreadsheet for dynamic use. Researched new opportunities, tripling the number of proposals in annual rotation within the first year, and doubling the amount awarded compared to the prior year.</p> <p>Customized a new cloud-based database platform, improving the ability to track both clients and donors, gauge the success of each program and analyze data for grant writing and reporting. Oversaw transition to new database, documenting internal protocols & procedures and training staff members. Devised a new system for data collection; simplified reporting for off-site service providers and streamlined data entry for administrative staff.</p> <p>Created original designs and wrote compelling copy for major donor appeals, fundraising events, press releases, thank-you letters, and program marketing materials. Capitalized on graphic design and desktop publishing skills to create engaging full-color grant proposals for funders without specific format requirements.",
      "image": "lda-logo.png",
      "website": "https://ldastl.org/"
  },
  {
      "id": 3,
      "employer": "Harambee Youth Training Corporation",
      "period": "October 2002 - September 2014",
      "title": "Administrator &#124; Grant Writer &#124; Graphic Designer",
      "type": "Full-time",
      "location": "St. Louis, MO",
      "desc": "Provided critical support in all administrative areas, directly contributing to the growth of Harambee from a small summer program with a budget of $147,500 to a thriving organization with 24 year-round employees and an annual budget of nearly $1.4M.</p> <p>Assumed full bookkeeping & accounting responsibilities in 2006; restructured accounts twice in step with rapid organizational growth, streamlining financial reporting and improving the week-to-week cash flow analysis. Tracked over $1.4M in private contributions and facilitated participation in the Missouri AHAP tax credit program, bringing in an additional $2M in donations.</p> <p>Authored over 30 successful grant proposals, resulting in over $1.5M in federal block grant funding and other grants; managed contracts, reimbursement requests, documentation, reporting and audits. Designed tailored in-house solutions for the collection, management, and reporting of demographic and program-specific data on hundreds of youth participants, homeowner clients, and community service projects.</p> <p>Crafted visually engaging and well-written newsletters, brochures, and other literature; designed t-shirts; produced customized forms, from client & employee applications to client intake forms, employee time sheets, and various internal documents.",
      "image": "harambee-logo.png",
      "website": "https://restorestlouis.org/harambee-youth-training/"
  }
]