[
    {
        "id": 0,
        "author": "Mandy Schultz",
        "title": "Candidate Engagement Manager, LaunchCode",
        "recText": "&quot;Carrie is an exceptional mentor for the CoderGirl program, and my job is a little easier because of her. In addition to her incredible dedication to students and impressive coding chops, Carrie also goes above and beyond by creating additional resources for the students to practice with. She is proactive, and a compassionate advocate for her students, and I'm truly grateful for her presence and influence in the program.&quot;"
    },
    {
        "id": 1,
        "author": "Nick Rafferty",
        "title": "Candidate Engagement Manager, LaunchCode",
        "recText": "&quot;Carrie's spark that she brought to the classroom made an impact within the first week. I managed LaunchCode's LC101 course that Carrie completed, and I was impressed that Carrie did not wait to help classmates out. Within the first week, Carrie was active on Slack, answering student questions, and posting her own. Through her help, she opened a door for many other classmates to feel comfortable asking questions.</p> <p>&quot;Carrie's commitment to creating a community continued throughout the course. Carrie opened up about her background and experience in the course during a presentation to the class about Imposter Syndrome. Carrie was selected as the lead speaker due to her strong leadership skills and commitment to being honest and transparent.</p> <p>&quot;I have no doubt that Carrie will not only be a strong full-stack engineer, but will bring her leadership skills to any role.&quot;"
    },
    {
        "id": 2,
        "author": "Shivany Shenoy",
        "title": "Lead Instructor, LaunchCode",
        "recText": "&quot;I had the pleasure of knowing and mentoring Carrie as a Lead Instructor for LaunchCode LC101 and LiftOff programs. I can easily say Carrie was one of our top students and very quickly demonstrated core proficiency in Java and any related technical skills. She took the courses in addition to working 2 other jobs at the same time, and didn't let a pandemic deter her from completing the course work as well as going above and beyond the basic requirements. In addition, she was available to help other students in her group. I admire her resilience, tenacity, willingness to form a connection with others looking for help. I can honestly say I am better off for knowing her and working with her through these past 6 months. I wish her the very best and praise any organization willing to tap into her technical skills and leadership potential.&quot;"
    },
    {
        "id": 3,
        "author": "Blake Mills",
        "title": "Mentor, LaunchCode",
        "recText": "&quot;Carrie's intelligence and communication skills are apparent from the moment you meet her. I mentored Carrie as part of a group project. Carrie quickly demonstrated key abilities to break complex tasks down, asks questions when stuck, and actually get things done. I have no doubt that Carrie can succeed in any career field she chooses, including as a software developer.&quot;"
    },
    {
        "id": 4,
        "author": "Will Farrell",
        "title": "Lead Instructor, LaunchCode",
        "recText": "&quot;Carrie has a lot of positive qualities that make her ready to step in and contribute as a developer on day one. She's smart, works collaboratively with others, and has a growth mindset. While teaching as the lead instructor for LaunchCode, I was able to observe Carrie and her entire group learn the basics of JavaScript. What impressed me about Carrie and her team, is how they start by experimenting and trying things on their own, but then paired that with a willingness to ask questions to understand and verify their assumptions.&quot;"
    },
    {
        "id": 5,
        "author": "Hunter Mehring",
        "title": "Tech Leadership Fellow, LaunchCode",
        "recText": "&quot;I had the great pleasure of having Ms. Carrie Jones as a student for six months in her programming “boot camp” with LaunchCode. During the course Carrie exemplified exactly what a teacher wants in a student. She is passionate and driven in every endeavor she pursues. There is very little that Carrie cannot do.</p> <p>&quot;What stood out most of all about Carrie was her ability to go above and beyond the course material. Carrie would never stop going 100% until the extra credit of the project was done. Even more, she was adamant about finishing every piece of work that was assigned, even if it was not required.</p> <p>&quot;During the course Carrie took a front seat when it came to helping other students. She continuously found driven individuals within the class and formed her own study groups where they would work on their programs together. While Carrie was technically a student in the class, she did just as much teaching as learning.</p> <p>&quot;Oftentimes the hardest transition for a developer is the first step outside of the classroom, but I have no doubt that Carrie will meet that challenge with professionalism and enthusiasm. If Carrie wants to do it, she will.</p> <p>&quot;I cannot recommend Carrie enough for her work ethic, excellence, and intelligence that she brings to the table.&quot;"
    }
]