[
    {
        "year": "1983",
        "desc": "My dad brought home a TRS-80 from Radio Shack, and I picked up DOS quickly so I could play on it. My favorite thing was making pictures out of characters, line by line, and then seeing them come off of the dot matrix printer. In a way, I think this was my first introduction to coding concepts."
    },
    {
        "year": "1985",
        "desc": "I have good memories of playing text adventure games like Inca Temple and having a &quot;conversation&quot; with ELIZA on the Tandy."
    },
    {
        "year": "1986",
        "desc": "I got the coveted NES for Christmas, and was in love. I still have my console hooked up to my TV, and from time to time I pull out Super Mario Bros., the Legend of Zelda, Tetris, Ultima, or others for a good dose of nostalgia. I think it was during this period that I really became fascinated with the idea about how these programs were created even though I didn't know what code looked like yet."
    },
    {
        "year": "1991",
        "desc": "When she wasn't using it for her college homework, I used my mom's Commodore Colt to play the original (monochrome!) SimCity and to practice my typing skills."
    },
    {
        "year": "1995-1997",
        "desc": "In college I was given my first e-mail address and also my own web page as part of an Intro to CS class in the engineering school. I learned HTML (such as it was), checked my e-mail in PINE using Telnet, and occasionally took breaks to play Acrophobia on IRC. A class on numerical methods introduced me to FORTRAN and MATLAB, a drafting class covered AutoCAD, and in the architecture school I was introduced to rendering programs like Form-Z."
    },
    {
        "year": "2001",
        "desc": "Hearkening back to my early days playing text adventure games on my dad's Tandy, I got interested in interactive fiction. I decided to learn the TADS platform and coded several stories/games over the next couple of years, just for fun. Around this same time I started using the GIMP for graphic design."
    },
    {
        "year": "2003",
        "desc": "I worked with a volunteer at the church I was attending at the time to come up with the architecture for a new custom Access database to track donors and contributions. I also decided to learn CSS and, combining that with my knowledge of HTML, I was able to help maintain their website over the next decade or so."
    },
    {
        "year": "2016",
        "desc": "My sister opened her own salon, and I structured her website, managed her social media accounts, and did custom graphic design not just for those but for a host of marketing materials as well."
    },
    {
        "year": "2019",
        "desc": "Having recovered from cancer and chemo, I was finally in a position to think about a total career change. I started studying a few things on the side, like Python, but things really took off when I was accepted into LaunchCode's LC101 program and learned multiple languages, tools, and platforms in a short amount of time. I was voracious, using sites like HackerRank and CodeWars to solve hundreds of practice problems."
    },
    {
        "year": "2020",
        "desc": "Upon graduating from LC101 and completing a capstone project in the Liftoff program, I began an apprenticeship where I continued to learn new technologies. I also began working as a mentor for students in the CoderGirl program at LaunchCode. I have created over 50 supplemental practice exercises/projects for students and held several <a href='https://www.youtube.com/channel/UCn_hsW3O-8uPCdr9_gQ5d4g' target='_blank'>live tutorials</a> to help them prepare for larger graded assignments."
    },
    {
        "year": "2021",
        "desc": "I am close to completing the comprehensive course on Angular at Udemy, and I am continuing to add new material to my collection of practice exercises for students."
    }
]